In [1]:
import pandas as pd

In [2]:
pd.set_option('display.max_rows', 10)

In [3]:
plans_df = pd.read_csv('data/plans.csv')

In [4]:
plans_df.describe()

               rate     rate_area
count  22240.000000  22240.000000
mean     312.224440     12.880396
std       83.936313     14.111441
min       99.530000      1.000000
25%      254.000000      4.000000
50%      301.660000      8.000000
75%      358.705000     15.000000
max      771.520000     67.000000

In [5]:

silver_plans_df = plans_df[plans_df['metal_level'] == 'Silver'][
    ['state','rate_area','rate']].drop_duplicates()

In [6]:
silver_plans_df.describe()

         rate_area         rate
count  8205.000000  8205.000000
mean     13.191469   314.684788
std      13.960566    59.090232
min       1.000000    99.530000
25%       4.000000   276.550000
50%       8.000000   306.480000
75%      15.000000   346.890000
max      67.000000   664.000000

In [7]:
ranked_selver_plans_df = silver_plans_df.assign(
        rn=silver_plans_df.sort_values(["rate"])
        .groupby([ 'state', 'rate_area'])
        .cumcount() + 1
    ).sort_values([ 'state', 'rate_area', "rn"])

In [8]:
ranked_selver_plans_df[
    (ranked_selver_plans_df['state'] == 'MO') & 
    (ranked_selver_plans_df['rate_area'] == 3) ]

      state  rate_area    rate  rn
975      MO          3  234.60   1
13899    MO          3  245.20   2
3727     MO          3  251.08   3
16245    MO          3  253.65   4
14123    MO          3  265.25   5
...     ...        ...     ...  ..
19085    MO          3  298.87   9
13352    MO          3  312.06  10
18034    MO          3  319.57  11
22209    MO          3  341.24  12
10033    MO          3  351.60  13

[13 rows x 4 columns]

In [9]:
sl_silver_plans_df = ranked_selver_plans_df[ranked_selver_plans_df['rn'] == 2]

In [10]:
del_condition = ranked_selver_plans_df[['state', 'rate_area']].isin(
    sl_silver_plans_df[['state', 'rate_area']])


def_silver_plans_df = ranked_selver_plans_df.drop(
    ranked_selver_plans_df[del_condition].index)

In [11]:
def_silver_plans_df[
    (def_silver_plans_df['state'] == 'MO') & 
    (def_silver_plans_df['rate_area'] == 3) ]

Empty DataFrame
Columns: [state, rate_area, rate, rn]
Index: []

In [37]:
zips_df = pd.read_csv('data/zips.csv')[
    ['zipcode', 'state', 'rate_area']]

In [38]:
zips_df[zips_df['zipcode'] == 31551]

      zipcode state  rate_area
8317    31551    GA          6
9531    31551    GA          6

In [39]:
zips_df = zips_df.drop_duplicates(keep=False)

In [40]:
zips_df[zips_df['zipcode'] == 31551]

Empty DataFrame
Columns: [zipcode, state, rate_area]
Index: []

In [14]:
zip_sl_rates_df = pd.merge(zips_df, sl_silver_plans_df)

In [34]:
zip_sl_rates_df[zip_sl_rates_df['zipcode'] == 31551]

Empty DataFrame
Columns: [zipcode, state, rate_area, rate, rn]
Index: []

In [16]:
zip_def_rates_df = pd.merge(zips_df, def_silver_plans_df)

In [33]:
zip_def_rates_df[zip_def_rates_df['zipcode'] == 31551]

Empty DataFrame
Columns: [zipcode, state, rate_area, rate, rn]
Index: []

In [18]:
zip_rates_df = pd.concat([zip_sl_rates_df, zip_def_rates_df])[['zipcode','rate' ]]

In [32]:
zip_rates_df[zip_rates_df['zipcode'] == 31551]

Empty DataFrame
Columns: [zipcode, rate]
Index: []

In [20]:
slcsp_df = pd.read_csv('data/slcsp.csv')

In [21]:
slcsp_df

    zipcode  rate
0     64148   NaN
1     67118   NaN
2     40813   NaN
3     18229   NaN
4     51012   NaN
..      ...   ...
46    86313   NaN
47    61232   NaN
48    20047   NaN
49    47452   NaN
50    31551   NaN

[51 rows x 2 columns]

In [22]:
slcsp_df.update(pd.merge(slcsp_df, zip_rates_df, on = 'zipcode').rename(columns={'rate_y':'rate'}))

In [23]:
slcsp_df

    zipcode    rate
0   64148.0  245.20
1   18229.0  231.48
2   51012.0  252.76
3   79168.0  243.68
4   54923.0  255.26
..      ...     ...
46  86313.0     NaN
47  61232.0     NaN
48  20047.0     NaN
49  47452.0     NaN
50  31551.0     NaN

[51 rows x 2 columns]